cost4 = ["25 บาท", "30 บาท", "45 บาท", "55 บาท", "60 บาท"]
cost6 = ["40 บาท", "45 บาท", "75 บาท", "90 บาท", "100 บาท"]
cost6more = ["60 บาท", "70 บาท", "110 บาท", "130 บาท", "140 บาท"]
costs = [cost4, cost6, cost6more]

way = ["ลาดกระบัง-->บางบ่อ","ลาดกระบัง-->บางประกง",
      "ลาดกระบัง-->พนัสนิคม","ลาดกระบัง-->บ้านบึง",
      "ลาดกระบัง-->บางพระ"]

print("""###################################################

\tโปรแกรมคำนวณค่าผ่านทางมอเตอร์เวย์
            
###################################################
     รถยนต์ 4 ล้อ              กด 1
     รถยนต์ 6 ล้อ              กด 2
     รถยนต์มากกว่า 6 ล้อ        กด 3
###################################################      """)

x = int(input("\tเลือกประเภทยานพาหนะ : "))
y = ["ค่าบริการรถยนต์ 4 ล้อ", "ค่าบริการรถยนต์ 6 ล้อ", "ค่าบริการรถยนต์มากกว่า 6 ล้อ"]
i = (x)-1

print("\n" + y[i])
print(f"{way[0]} {costs[i][0]}")
print(f"{way[1]} {costs[i][1]}")
print(f"{way[2]} {costs[i][2]}")
print(f"{way[3]} {costs[i][3]}")
print(f"{way[4]} {costs[i][4]}")

print("###################################################")