#โปรแกรมคำนวณค่าผ่านททางมอเตอร์เวย์ 

print("--------------------------------------------\n      โปรแกรมคำนวณค่าผ่านทางมอเตอร์เวย์ \n--------------------------------------------")
print("\n รถยนต์ 4 ล้อ : กด 1 \n รถยนต์ 6 ล้อ : กด 2\n รถยนต์มากกว่า 6 ล้อ : กด 3 \n")

thisdict = {
    "1" : "รถยนต์ 4 ล้อ \n""ลาดกระบัง --> บางบ่อ : 30 บาท \n""ลาดกระบัง --> บางประกง : 45 บาท \n""ลาดกระบัง --> พนัสนิคม : 55 บาท \n" "ลาดกระบัง --> บ้านบึง : 60 บาท \n""ลาดกระบัง --> บางพระ : 80 บาท \n",
    "2" : "รถยนต์ 6 ล้อ \n" "ลาดกระบัง --> บางบ่อ : 45 บาท \n" "ลาดกระบัง --> บางประกง : 75 บาท \n""ลาดกระบัง --> พนัสนิคม : 90 บาท \n""ลาดกระบัง --> บ้านบึง : 100 บาท \n""ลาดกระบัง --> บางพระ : 130 บาท \n",
    "3" : "รถยนต์มากกว่า 6 ล้อ \n""ลาดกระบัง --> บางบ่อ : 70 บาท \n" "ลาดกระบัง --> บางประกง : 110 บาท \n""ลาดกระบัง --> พนัสนิคม : 130 บาท \n""ลาดกระบัง --> บ้านบึง : 140 บาท \n""ลาดกระบัง --> บางพระ : 190 บาท \n",
    }
x = input("เลือกประเภทยานพาหนะ : ")
print("---------------------------------------")
print("\nค่าบริการของ",thisdict[x])
print("---------------------------------------")